fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалоРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненыеРаботы</name>
    <attributes>
      <name>ОписаниеРаботы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных	
	
перем ЗнчРеквизитовОбъектаВБазе;
	
#КонецОбласти

#Область ОбработчикиСобытий	

Процедура ОбработкаПроведения(Отказ,Режим)
	
	ДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"Договор" );
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента,"ВидДоговора" );
	
	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Необходим вид дговора на обслуживание!!!");
		Возврат;
		
	КонецЕсли;
	
	ДанныеДоговораОбслуживания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента,"ВидДоговора,ВКМ_ДатаНачалаДоговора,ВКМ_ДатаОкончанияДоговора,ВКМ_СтоимостьЧасаРаботы" );
	
	
	
	
	ДатаНачала = ДанныеДоговораОбслуживания.ВКМ_ДатаНачалаДоговора;
	ДатаОкончания = ДанныеДоговораОбслуживания.ВКМ_ДатаОкончанияДоговора;
	СтоимостьЧасаРаботы = ДанныеДоговораОбслуживания.ВКМ_СтоимостьЧасаРаботы;
	
	Если НЕ (Дата >= ДатаНачала И Дата <= ДатаОкончания) Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Закончился договор обслуживания");
	
		Возврат;
		
	КонецЕсли;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ВыполненыеРаботы.Итог("ЧасыКОплатеКлиенту");
	Движение.СуммаКОплате = Движение.КоличествоЧасов * СтоимостьЧасаРаботы;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
   
    
	Если ОбменДанными.Загрузка Или ЭтоНовый() Тогда
	   Возврат;
	КонецЕсли;
	
	ЗнчРеквизитовОбъектаВБазе = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"Клиент,Специалист,ДатаПроведенияРабот,ВремяНачалоРабот,ВремяОкончанияРабот" );
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НужноУведомление = Ложь;
	
	Если   ЗнчРеквизитовОбъектаВБазе = Неопределено   Тогда
		НужноУведомление = Истина;
		ТекстУведомления = СтрШаблон("Новая  задача от %1 .Выполнить: %2. Дата и время выполнения: %3 с %4 до %5.Исполнитель : %6",
		                             Клиент,ОписаниеПроблемы,ДатаПроведенияРабот,
		                             ВремяНачалоРабот,ВремяОкончанияРабот,Специалист);
	Иначе
		ТекстУведомления = СтрШаблон("Изменения в задаче от %1. Выполнить: %2.", Клиент,ОписаниеПроблемы);
		
		Если ДатаПроведенияРабот <> ЗнчРеквизитовОбъектаВБазе.ДатаПроведенияРабот Тогда
			НужноУведомление = Истина;
			ТекстУведомления = ТекстУведомления + СтрШаблон(" Дата %1.",Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy;" ));
		КонецЕсли;
		
	    Если ВремяНачалоРабот <> ЗнчРеквизитовОбъектаВБазе.ВремяНачалоРабот Тогда
			НужноУведомление = Истина;
			ТекстУведомления = ТекстУведомления + СтрШаблон(" Время начало работы в %1.",Формат(ВремяНачалоРабот,"ДЛФ=T;" ));
	    КонецЕсли;
	        
	    Если ВремяОкончанияРабот <> ЗнчРеквизитовОбъектаВБазе.ВремяОкончанияРабот Тогда
			НужноУведомление = Истина;
			ТекстУведомления = ТекстУведомления + СтрШаблон(" Время окончания работы до %1.",Формат(ВремяОкончанияРабот,"ДЛФ=T;" ));
		КонецЕсли;
       
        Если Специалист <> ЗнчРеквизитовОбъектаВБазе.Специалист Тогда
        	НужноУведомление = Истина;
			ТекстУведомления = ТекстУведомления + СтрШаблон(" Заменен исполнитель на %1", Специалист );
		КонецЕсли;	
        	
	КонецЕсли;
	
	Если НужноУведомление Тогда
	     НовоеУведомление = Справочники.ВКМ_УведомленияТелеграммБоту.СоздатьЭлемент();
	     НовоеУведомление.ТекстСообщения = ТекстУведомления;
	     НовоеУведомление.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
